
// 🎓 รายวิชาเสรีทั้งหมด
export const electiveCourses = [
  { id: '030953115', code: '030953115', name: 'สมาธิเพื่อการพัฒนา', credits: 3 },
  { id: '080203901', code: '080203901', name: 'มนุษย์กับสังคม', credits: 3 },
  { id: '080203904', code: '080203904', name: 'กฎหมายในชีวิตประจําวัน', credits: 3 },
  { id: '080303103', code: '080303103', name: 'จิตวิทยาเพื่อความสุขในการดำรงชีวิต', credits: 3 },
  { id: '080303401', code: '080303401', name: 'คาราโอเกะ', credits: 3 },
  { id: '080303601', code: '080303601', name: 'มนุษยสัมพันธ์', credits: 3 },
  { id: '080303609', code: '080303609', name: 'สุขภาพเพื่อชีวิต', credits: 3 },
  { id: '080303607', code: '080303607', name: 'ความปลอดภัยในชีวิต', credits: 3 },
  { id: '040313017', code: '040313017', name: 'ทักษะการออกกำลังกายและกีฬา', credits: 3 },
  { id: '040313018', code: '040313018', name: 'ร่างกายมนุษย์และสุขภาพ', credits: 3 },
  { id: '040713002', code: '040713002', name: 'วิทยาศาสตร์สุขภาพและโภชนาการ', credits: 3 },
  { id: '040713005', code: '040713005', name: 'สมุนไพรเพื่อสุขภาพ', credits: 3 },
  { id: '030923102', code: '030923102', name: 'วิทยาศาสตร์ในชีวิตประจำวัน', credits: 3 },
  { id: '030923103', code: '030923103', name: 'วิทยาศาสตร์และเทคโนโลยีเพื่อคุณภาพชีวิตและสังคม', credits: 3 },
  { id: '030923100', code: '030923100', name: 'Physics for Technologist', credits: 3 },
  { id: '030923101', code: '030923101', name: 'Energy Resources', credits: 3 },
  { id: '030943131', code: '030943131', name: 'คณิตศาสตร์ในชีวิตประจําวัน', credits: 3 }
];